tylertms/dspic33e-sim/tests/device/can_test.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "device.h"
#include "dspic33.h"
#include "test.h"

static const uint16_t bases[DSPIC33_CAN_COUNT] = {0x0400u, 0x0500u};
static const uint8_t event_irqs[DSPIC33_CAN_COUNT] = {35u, 56u};
static const uint8_t receive_requests[DSPIC33_CAN_COUNT] = {34u, 55u};
static const uint8_t transmit_requests[DSPIC33_CAN_COUNT] = {70u, 71u};
static void write_memory_word(Dspic33* cpu, uint32_t address, uint16_t value);

enum {
    CAN_INTERRUPT_ERROR = 0x0020u,
    CAN_ERROR_WARNING = 0x0100u,
    CAN_RECEIVE_WARNING = 0x0200u,
    CAN_TRANSMIT_WARNING = 0x0400u,
    CAN_RECEIVE_PASSIVE = 0x0800u,
    CAN_TRANSMIT_PASSIVE = 0x1000u,
    CAN_BUS_OFF = 0x2000u,
    CAN_ERROR_STATUS_MASK = 0x3f00u,
    FIFO_RELATION_THRESHOLD = 0u,
    FIFO_RELATION_EQUAL = 1u,
    FIFO_RELATION_DISTANT = 2u
};

static void reset_can_raw(Dspic33* cpu, uint32_t entry) { dspic33_reset(cpu, entry); }

static void reset_can_fixture(Dspic33* cpu, uint32_t entry) {
    reset_can_raw(cpu, entry);
    dspic33_gpio_drive(cpu, 3u, 0xffffu, 0xffffu);
}

#define dspic33_reset reset_can_fixture

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    uint16_t flag = (uint16_t)(1u << (irq % 16u));
    dspic33_write_word(cpu, address,
                       (uint16_t)(dspic33_read_word(cpu, address) & ~flag));
}

static uint16_t dma_base(uint8_t channel) {
    return (uint16_t)(0x0b00u + channel * 0x10u);
}

static void configure_dma(Dspic33* cpu, uint8_t channel, uint16_t control,
                          uint8_t request, uint32_t memory, uint16_t pad) {
    uint16_t base = dma_base(channel);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)memory);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(memory >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), 7u);
    dspic33_write_word(cpu, base, (uint16_t)(0x8000u | control));
}

static void select_window(Dspic33* cpu, uint8_t channel, bool filter) {
    uint16_t base = bases[channel];
    uint16_t control = dspic33_read_word(cpu, base);
    dspic33_write_word(cpu, base,
                       filter ? (uint16_t)(control | 1u) : (uint16_t)(control & ~1u));
}

static uint64_t mode_transition_cycles(Dspic33* cpu, uint8_t channel) {
    uint16_t base = bases[channel];
    uint16_t config1 = dspic33_read_word(cpu, (uint16_t)(base + 0x10u));
    uint16_t config2 = dspic33_read_word(cpu, (uint16_t)(base + 0x12u));
    uint16_t control = dspic33_read_word(cpu, base);
    uint64_t prescaler = (config1 & 0x003fu) + 1u;
    uint64_t quanta = 1u + (config2 & 7u) + 1u + ((config2 >> 3u) & 7u) + 1u +
                      ((config2 >> 8u) & 7u) + 1u;
    uint64_t clock_divisor = (control & 0x0800u) != 0u ? 2u : 1u;
    return 11u * prescaler * quanta * clock_divisor;
}

static void request_mode(Dspic33* cpu, uint8_t channel, uint8_t mode) {
    uint16_t base = bases[channel];
    uint16_t control = dspic33_read_word(cpu, base);
    control = (uint16_t)((control & ~0x0700u) | ((uint16_t)mode << 8u));
    dspic33_write_word(cpu, base, control);
}

static void set_mode(Dspic33* cpu, uint8_t channel, uint8_t mode) {
    request_mode(cpu, channel, mode);
    dspic33_device_advance(cpu, mode_transition_cycles(cpu, channel));
}

static void configure_filter(Dspic33* cpu, uint8_t channel, uint8_t filter,
                             uint32_t identifier, bool extended, uint32_t mask,
                             bool match_type, uint8_t buffer, uint8_t mask_index) {
    uint16_t base = bases[channel];
    uint32_t sid = extended ? (identifier >> 18u) & 0x7ffu : identifier & 0x7ffu;
    uint32_t eid = identifier & 0x3ffffu;
    uint32_t mask_sid = extended ? (mask >> 18u) & 0x7ffu : mask & 0x7ffu;
    uint32_t mask_eid = mask & 0x3ffffu;
    uint16_t filter_sid = (uint16_t)((sid << 5u) | ((eid >> 16u) & 3u));
    uint16_t receive_mask = (uint16_t)((mask_sid << 5u) | ((mask_eid >> 16u) & 3u));
    uint16_t address;
    uint16_t value;
    if (extended) {
        filter_sid |= 8u;
    }
    if (match_type) {
        receive_mask |= 8u;
    }
    select_window(cpu, channel, true);
    dspic33_write_word(cpu, (uint16_t)(base + 0x30u + mask_index * 4u), receive_mask);
    dspic33_write_word(cpu, (uint16_t)(base + 0x32u + mask_index * 4u),
                       (uint16_t)mask_eid);
    dspic33_write_word(cpu, (uint16_t)(base + 0x40u + filter * 4u), filter_sid);
    dspic33_write_word(cpu, (uint16_t)(base + 0x42u + filter * 4u), (uint16_t)eid);
    address = (uint16_t)(base + (filter < 8u ? 0x18u : 0x1au));
    value = dspic33_read_word(cpu, address);
    value = (uint16_t)((value & ~(uint16_t)(3u << ((filter & 7u) * 2u))) |
                       ((uint16_t)mask_index << ((filter & 7u) * 2u)));
    dspic33_write_word(cpu, address, value);
    address = (uint16_t)(base + 0x20u + (filter / 4u) * 2u);
    value = dspic33_read_word(cpu, address);
    value = (uint16_t)((value & ~(uint16_t)(0x0fu << ((filter & 3u) * 4u))) |
                       ((uint16_t)buffer << ((filter & 3u) * 4u)));
    dspic33_write_word(cpu, address, value);
}

static void enable_filter(Dspic33* cpu, uint8_t channel, uint16_t enabled) {
    dspic33_write_word(cpu, (uint16_t)(bases[channel] + 0x14u), enabled);
}

static void configure_receive(Dspic33* cpu, uint8_t channel, uint32_t memory,
                              uint8_t dmabs, uint8_t fifo_start) {
    uint16_t base = bases[channel];
    configure_dma(cpu, (uint8_t)(channel * 2u), 0x0020u, receive_requests[channel],
                  memory, (uint16_t)(base + 0x40u));
    dspic33_write_byte(cpu, (uint16_t)(base + 6u), fifo_start);
    dspic33_write_byte(cpu, (uint16_t)(base + 7u), (uint8_t)(dmabs << 5u));
}

static void fifo_control_write_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t address = (uint16_t)(bases[channel] + 6u);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, address, 0xa012u);
        expect(state, dspic33_read_word(cpu, address) == 0u,
               "CAN FIFO control rejects a word write");
        dspic33_write_byte(cpu, (uint16_t)(address + 1u), 0xa0u);
        expect(state, dspic33_read_word(cpu, address) == 0u,
               "CAN FIFO control rejects DMABS before FSA");
        dspic33_write_byte(cpu, address, 0x12u);
        expect(state, dspic33_read_word(cpu, address) == 0x0012u,
               "CAN FIFO control accepts FSA first");
        dspic33_write_byte(cpu, (uint16_t)(address + 1u), 0xa0u);
        expect(state,
               dspic33_read_word(cpu, address) == 0xa012u &&
                   cpu->io.can_fifo_write[channel] == 0x12u &&
                   (cpu->io.can_fctrl_fsa_ready & (uint8_t)(1u << channel)) == 0u,
               "CAN FIFO control accepts DMABS after FSA");
    }
}

static void configure_transmit(Dspic33* cpu, uint8_t channel, uint32_t memory) {
    configure_dma(cpu, (uint8_t)(channel * 2u + 1u), 0x2020u,
                  transmit_requests[channel], memory,
                  (uint16_t)(bases[channel] + 0x42u));
}

static Dspic33CanFrame frame(uint32_t identifier, bool extended, bool remote,
                             uint8_t length, uint8_t seed) {
    Dspic33CanFrame result;
    uint8_t index;
    memset(&result, 0, sizeof(result));
    result.identifier = identifier;
    result.extended = extended;
    result.remote = remote;
    result.length = length;
    for (index = 0u; index < length && index < sizeof(result.data); index++) {
        result.data[index] = (uint8_t)(seed + index * 17u);
    }
    return result;
}

static void write_transmit_frame(Dspic33* cpu, uint32_t memory,
                                 const Dspic33CanFrame* value) {
    uint16_t words[8] = {0};
    uint32_t sid =
        value->extended ? (value->identifier >> 18u) & 0x7ffu : value->identifier;
    uint32_t eid = value->identifier & 0x3ffffu;
    words[0] = (uint16_t)(sid << 2u);
    if (value->extended) {
        words[0] |= 3u;
        words[1] = (uint16_t)(eid >> 6u);
        words[2] = (uint16_t)((eid & 0x3fu) << 10u);
        if (value->remote) {
            words[2] |= 0x0200u;
        }
    } else if (value->remote) {
        words[0] |= 2u;
    }
    words[2] |= value->length;
    for (uint8_t index = 0u; index < value->length; index++) {
        words[3u + index / 2u] |= (uint16_t)value->data[index] << ((index & 1u) * 8u);
    }
    for (uint8_t index = 0u; index < 8u; index++) {
        write_memory_word(cpu, memory + index * 2u, words[index]);
    }
}

static void clear_receive_flag(Dspic33* cpu, uint8_t channel, uint8_t buffer) {
    uint16_t address = (uint16_t)(bases[channel] + 0x20u + (buffer >= 16u ? 2u : 0u));
    uint16_t value = dspic33_read_word(cpu, address);
    dspic33_write_word(cpu, address,
                       (uint16_t)(value & ~(uint16_t)(1u << (buffer & 15u))));
}

