tylertms/dspic33e-sim/tests/device/can_test.c
static void standard_filter_domain(TestState* state, Dspic33* cpu) {
    uint16_t identifier;
    uint16_t expected = 0x5a0u;
    uint16_t mask = 0x7f0u;
    Dspic33CanFrame input;
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, 0u, 0x2000u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, expected, false, mask, true, 0u, 0u);
    enable_filter(cpu, 0u, 1u);
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    for (identifier = 0u; identifier <= 0x7ffu; identifier++) {
        bool accepted = (identifier & mask) == (expected & mask);
        input = frame(identifier, false, false, 2u, (uint8_t)identifier);
        expect(state, dspic33_can_receive(cpu, 0u, &input, 0u),
               "standard domain schedule");
        expect(state, dspic33_device_advance(cpu, 32u), "standard domain advance");
        expect(state, receive_full(cpu, 0u, 0u) == accepted,
               "standard domain filter result");
        if (accepted) {
            expect(state, memory_word(cpu, 0x2000u) == (uint16_t)(identifier << 2u),
                   "standard domain identifier storage");
            clear_receive_flag(cpu, 0u, 0u);
        }
    }
}

static void extended_filter_cases(TestState* state, Dspic33* cpu) {
    static const uint32_t identifiers[] = {
        0u, 1u, 0x3ffffu, 0x40000u, 0x1ffffffu, 0x10000000u, 0x15555555u, 0x1fffffffu};
    uint8_t channel;
    uint8_t index;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (index = 0u; index < sizeof(identifiers) / sizeof(identifiers[0]);
             index++) {
            uint32_t identifier = identifiers[index];
            Dspic33CanFrame input = frame(identifier, true, false, 8u, index);
            dspic33_reset(cpu, 0u);
            configure_receive(cpu, channel, 0x3000u, 6u, 0u);
            configure_filter(cpu, channel, 3u, identifier, true, 0x1fffffffu, true, 6u,
                             1u);
            enable_filter(cpu, channel, 1u << 3u);
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 0u);
            expect(state,
                   dspic33_can_receive(cpu, channel, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "extended exact transfer");
            expect(state, receive_full(cpu, channel, 6u), "extended exact full flag");
            expect(state,
                   (((uint32_t)(memory_word(cpu, 0x3060u) >> 2u) & 0x7ffu) << 18u) ==
                       (identifier & 0x1ffc0000u),
                   "extended SID storage");
            expect(state,
                   (((uint32_t)(memory_word(cpu, 0x3062u) & 0x0fffu) << 6u) |
                    (memory_word(cpu, 0x3064u) >> 10u)) == (identifier & 0x3ffffu),
                   "extended EID storage");
        }
    }
}

static void payload_and_remote_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t length;
    uint8_t extended;
    uint8_t remote;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (extended = 0u; extended < 2u; extended++) {
            for (remote = 0u; remote < 2u; remote++) {
                for (length = 0u; length <= 8u; length++) {
                    uint32_t identifier = extended != 0u ? 0x1234567u : 0x567u;
                    Dspic33CanFrame input =
                        frame(identifier, extended != 0u, remote != 0u, length,
                              (uint8_t)(0x20u + length));
                    uint8_t index;
                    dspic33_reset(cpu, 0u);
                    configure_receive(cpu, channel, 0x4000u, 4u, 0u);
                    configure_filter(cpu, channel, 0u, identifier, extended != 0u,
                                     extended != 0u ? 0x1fffffffu : 0x7ffu, true, 2u,
                                     0u);
                    enable_filter(cpu, channel, 1u);
                    select_window(cpu, channel, false);
                    set_mode(cpu, channel, 0u);
                    expect(state,
                           dspic33_can_receive(cpu, channel, &input, 0u) &&
                               dspic33_device_advance(cpu, 32u),
                           "payload transfer");
                    expect(state, (memory_word(cpu, 0x4024u) & 0x0fu) == length,
                           "payload length");
                    for (index = 0u; index < length; index++) {
                        uint16_t word =
                            memory_word(cpu, (uint32_t)(0x4026u + (index / 2u) * 2u));
                        expect(state,
                               (uint8_t)(word >> ((index & 1u) * 8u)) ==
                                   input.data[index],
                               "payload byte");
                    }
                    expect(state,
                           extended != 0u ? ((memory_word(cpu, 0x4024u) & 0x0200u) !=
                                             0u) == (remote != 0u)
                                          : ((memory_word(cpu, 0x4020u) & 2u) != 0u) ==
                                                (remote != 0u),
                           "remote encoding");
                }
            }
        }
    }
}

static void devicenet_cases(TestState* state, Dspic33* cpu) {
    uint8_t bits;
    uint8_t length;
    for (bits = 1u; bits <= 31u; bits++) {
        for (length = 0u; length <= 3u; length++) {
            Dspic33CanFrame input = frame(0x321u, false, false, length, 0xa5u);
            uint32_t data = 0u;
            uint8_t compared = bits > 18u ? 18u : bits;
            if (compared > length * 8u) {
                compared = (uint8_t)(length * 8u);
            }
            if (length > 0u) {
                data = (uint32_t)input.data[0] << 16u;
            }
            if (length > 1u) {
                data |= (uint32_t)input.data[1] << 8u;
            }
            if (length > 2u) {
                data |= input.data[2];
            }
            data = compared == 0u ? 0u : (data >> (24u - compared)) << (18u - compared);
            dspic33_reset(cpu, 0u);
            configure_receive(cpu, 0u, 0x5000u, 4u, 0u);
            configure_filter(cpu, 0u, 0u, 0x321u, false, 0x7ffu, true, 0u, 0u);
            select_window(cpu, 0u, true);
            dspic33_write_word(cpu, 0x0430u, (uint16_t)((0x7ffu << 5u) | 8u));
            dspic33_write_word(cpu, 0x0440u,
                               (uint16_t)((0x321u << 5u) | (data >> 16u)));
            dspic33_write_word(cpu, 0x0442u, (uint16_t)data);
            enable_filter(cpu, 0u, 1u);
            dspic33_write_word(cpu, 0x0402u, bits);
            select_window(cpu, 0u, false);
            set_mode(cpu, 0u, 0u);
            expect(state,
                   dspic33_can_receive(cpu, 0u, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "DeviceNet matching transfer");
            expect(state, receive_full(cpu, 0u, 0u), "DeviceNet match");
        }
    }
}

static void direct_buffer_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t buffer;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (buffer = 0u; buffer <= 14u; buffer++) {
            Dspic33CanFrame input =
                frame((uint32_t)(0x200u + buffer), false, false, 4u, buffer);
            dspic33_reset(cpu, 0u);
            configure_receive(cpu, channel, 0x6000u, 6u, 0u);
            configure_filter(cpu, channel, 0u, input.identifier, false, 0x7ffu, true,
                             buffer, 0u);
            enable_filter(cpu, channel, 1u);
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 0u);
            expect(state,
                   dspic33_can_receive(cpu, channel, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "direct buffer transfer");
            expect(state, receive_full(cpu, channel, buffer), "direct buffer full");
            expect(state,
                   memory_word(cpu, (uint32_t)(0x6000u + buffer * 16u)) ==
                       (uint16_t)(input.identifier << 2u),
                   "direct buffer address");
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0au)) & 2u) !=
                       0u,
                   "direct receive event");
        }
    }
}

static void fifo_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t sizes[] = {4u, 6u, 8u, 12u, 16u, 24u, 32u};
    uint8_t selection;
    for (selection = 0u; selection < sizeof(sizes); selection++) {
        uint8_t size = sizes[selection];
        uint8_t start = (uint8_t)(size / 2u);
        uint8_t count = (uint8_t)(size - start);
        uint8_t index;
        dspic33_reset(cpu, 0u);
        configure_receive(cpu, 0u, 0x7000u, selection, start);
        configure_filter(cpu, 0u, 0u, 0x456u, false, 0x7ffu, true, 15u, 0u);
        enable_filter(cpu, 0u, 1u);
        select_window(cpu, 0u, false);
        set_mode(cpu, 0u, 0u);
        for (index = 0u; index < count; index++) {
            Dspic33CanFrame input = frame(0x456u, false, false, 1u, index);
            uint8_t buffer = (uint8_t)(start + index);
            expect(state,
                   dspic33_can_receive(cpu, 0u, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "FIFO transfer");
            expect(state, receive_full(cpu, 0u, buffer), "FIFO full sequence");
            expect(state,
                   memory_word(cpu, (uint32_t)(0x7000u + buffer * 16u + 6u)) == index,
                   "FIFO payload sequence");
        }
        expect(state, ((dspic33_read_word(cpu, 0x0408u) >> 8u) & 0x3fu) == start,
               "FIFO write pointer wrap");
        {
            Dspic33CanFrame overflow = frame(0x456u, false, false, 1u, 0xeeu);
            expect(state,
                   dspic33_can_receive(cpu, 0u, &overflow, 0u) &&
                       dspic33_device_advance(cpu, 2u),
                   "FIFO overflow transfer attempt");
            expect(state,
                   (dspic33_read_word(cpu,
                                      (uint16_t)(0x0428u + (start >= 16u ? 2u : 0u))) &
                    (uint16_t)(1u << (start & 15u))) != 0u,
                   "FIFO overflow flag");
            expect(state, (dspic33_read_word(cpu, 0x040au) & 4u) != 0u,
                   "FIFO overflow interrupt flag");
        }
        clear_receive_flag(cpu, 0u, start);
        expect(state, (dspic33_read_word(cpu, 0x0408u) & 0x3fu) == start + 1u,
               "FIFO next read pointer");
    }
}

static void select_transmit_buffer(Dspic33* cpu, uint8_t channel, uint8_t buffer) {
    uint16_t address = (uint16_t)(bases[channel] + 0x30u + (buffer / 2u) * 2u);
    uint8_t shift = (uint8_t)((buffer & 1u) * 8u);
    uint16_t value = dspic33_read_word(cpu, address);
    value =
        (uint16_t)((value & ~(uint16_t)(0xffu << shift)) | (uint16_t)(0x80u << shift));
    dspic33_write_word(cpu, address, value);
}

static bool transmit_buffer_selected(Dspic33* cpu, uint8_t channel, uint8_t buffer) {
    uint16_t address = (uint16_t)(bases[channel] + 0x30u + (buffer / 2u) * 2u);
    uint8_t shift = (uint8_t)((buffer & 1u) * 8u);
    return ((dspic33_read_word(cpu, address) >> shift) & 0x80u) != 0u;
}

static void fifo_overflow_advancement_case(TestState* state, Dspic33* cpu,
                                           uint8_t channel, bool listen_all, bool full,
                                           bool wrap) {
    uint16_t base = bases[channel];
    uint32_t memory = (uint32_t)(0xf000u + channel * 0x100u);
    Dspic33CanFrame input = frame(0x456u, false, false, 1u, 0x80u);
    uint8_t buffer = wrap ? 3u : 2u;
    uint8_t expected_next = wrap ? 2u : 3u;
    uint16_t flag = (uint16_t)(1u << buffer);
    uint16_t fnrb;
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, channel, memory, 0u, 2u);
    configure_filter(cpu, channel, 0u, input.identifier, false, 0x7ffu, true, 15u, 0u);
    enable_filter(cpu, channel, 1u);
    select_window(cpu, channel, false);
    set_mode(cpu, channel, listen_all ? 7u : 0u);
    if (wrap) {
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "FIFO overflow wrap preparation");
        expect(state,
               ((dspic33_read_word(cpu, (uint16_t)(base + 8u)) >> 8u) & 0x3fu) ==
                   buffer,
               "FIFO overflow wrap pointer preparation");
        clear_receive_flag(cpu, channel, 2u);
    }
    if (full) {
        write_memory_word(cpu, (uint16_t)(base + 0x20u), flag);
    } else {
        select_transmit_buffer(cpu, channel, buffer);
    }
    write_memory_word(cpu, memory + buffer * 16u, 0xa55au);
    fnrb = (uint16_t)(dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x003fu);
    expect(state,
           dspic33_can_receive(cpu, channel, &input, 0u) &&
               dspic33_device_advance(cpu, 2u),
           "FIFO overflow receive attempt");
    expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 0x28u)) & flag) != 0u,
           "FIFO overflow buffer flag");
    expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 4u) != 0u,
           "FIFO overflow event flag");
    expect(state,
           ((dspic33_read_word(cpu, (uint16_t)(base + 8u)) >> 8u) & 0x3fu) ==
               expected_next,
           "FIFO overflow advances write pointer");
    expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x003fu) == fnrb,
           "FIFO overflow preserves next read pointer");
    expect(state, memory_word(cpu, memory + buffer * 16u) == 0xa55au,
           "FIFO overflow loses message");
    expect(state, receive_full(cpu, channel, buffer) == full,
           "FIFO overflow preserves selected buffer state");
    expect(state, full || transmit_buffer_selected(cpu, channel, buffer),
           "FIFO overflow preserves transmit selection");
}

static void fifo_overflow_advancement_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t mode;
        for (mode = 0u; mode < 2u; mode++) {
            uint8_t cause;
            for (cause = 0u; cause < 2u; cause++) {
                uint8_t wrap;
                for (wrap = 0u; wrap < 2u; wrap++) {
                    fifo_overflow_advancement_case(state, cpu, channel, mode != 0u,
                                                   cause == 0u, wrap != 0u);
                }
            }
        }
    }
}

static void receive_flag_write_zero_domain(TestState* state, Dspic33* cpu) {
    static const uint8_t offsets[] = {0x20u, 0x22u, 0x28u, 0x2au};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t index;
        dspic33_reset(cpu, 0u);
        select_window(cpu, channel, false);
        for (index = 0u; index < sizeof(offsets); index++) {
            uint16_t address = (uint16_t)(bases[channel] + offsets[index]);
            uint32_t requested;
            for (requested = 0u; requested <= UINT16_MAX; requested++) {
                write_memory_word(cpu, address, UINT16_MAX);
                dspic33_write_word(cpu, address, (uint16_t)requested);
                expect(state, dspic33_read_word(cpu, address) == requested,
                       "receive flag write-zero domain");
            }
        }
    }
}

static void receive_overflow_write_zero_prior_domain(TestState* state, Dspic33* cpu) {
    static const uint8_t offsets[] = {0x28u, 0x2au};
    static const uint16_t previous_words[] = {0x0000u, 0x5a5au};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t index;
        dspic33_reset(cpu, 0u);
        select_window(cpu, channel, false);
        for (index = 0u; index < sizeof(offsets); index++) {
            uint16_t address = (uint16_t)(bases[channel] + offsets[index]);
            uint8_t previous_index;
            for (previous_index = 0u;
                 previous_index < sizeof(previous_words) / sizeof(previous_words[0]);
                 previous_index++) {
                uint16_t previous = previous_words[previous_index];
                uint32_t requested;
                for (requested = 0u; requested <= UINT16_MAX; requested++) {
                    write_memory_word(cpu, address, previous);
                    dspic33_write_word(cpu, address, (uint16_t)requested);
                    expect(state,
                           dspic33_read_word(cpu, address) ==
                               (uint16_t)(previous & requested),
                           "receive overflow write-zero prior domain");
                }
            }
        }
    }
}

static void receive_flag_read_pointer_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t sizes[] = {4u, 6u, 8u, 12u, 16u, 24u, 32u};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t selection;
        for (selection = 0u; selection < sizeof(sizes); selection++) {
            uint8_t size = sizes[selection];
            uint8_t start = (uint8_t)(size / 2u);
            uint8_t buffer;
            for (buffer = start; buffer < size; buffer++) {
                uint16_t address =
                    (uint16_t)(bases[channel] + 0x20u + (buffer >= 16u ? 2u : 0u));
                uint16_t bit = (uint16_t)(1u << (buffer & 15u));
                uint16_t fifo_address = (uint16_t)(bases[channel] + 8u);
                uint8_t expected = buffer + 1u == size ? start : (uint8_t)(buffer + 1u);
                dspic33_reset(cpu, 0u);
                configure_receive(cpu, channel, 0xf800u, selection, start);
                select_window(cpu, channel, false);
                write_memory_word(cpu, address, bit);
                write_memory_word(cpu, fifo_address,
                                  (uint16_t)(((uint16_t)start << 8u) | 0x003fu));
                dspic33_write_word(cpu, address, (uint16_t)~bit);
                expect(state, dspic33_read_word(cpu, address) == 0u,
                       "FIFO receive flag clear");
                expect(state,
                       (dspic33_read_word(cpu, fifo_address) & 0x003fu) == expected,
                       "FIFO receive flag advances read pointer");
                expect(state,
                       (dspic33_read_word(cpu, fifo_address) & 0x3f00u) ==
                           (uint16_t)((uint16_t)start << 8u),
                       "FIFO receive flag preserves write pointer");
            }
            if (start != 0u) {
                uint8_t buffer = (uint8_t)(start - 1u);
                uint16_t address = (uint16_t)(bases[channel] + 0x20u);
                uint16_t bit = (uint16_t)(1u << buffer);
                uint16_t fifo_address = (uint16_t)(bases[channel] + 8u);
                dspic33_reset(cpu, 0u);
                configure_receive(cpu, channel, 0xf800u, selection, start);
                select_window(cpu, channel, false);
                write_memory_word(cpu, address, bit);
                write_memory_word(cpu, fifo_address,
                                  (uint16_t)(((uint16_t)start << 8u) | 0x003eu));
                dspic33_write_word(cpu, address, (uint16_t)~bit);
                expect(state,
                       (dspic33_read_word(cpu, fifo_address) & 0x003fu) == 0x003eu,
                       "direct receive flag preserves FIFO read pointer");
            }
        }
    }
}

static void fifo_interrupt_boundary_case(TestState* state, Dspic33* cpu,
                                         uint8_t channel, bool wrap, uint8_t relation) {
    uint16_t base = bases[channel];
    uint16_t fifo_address = (uint16_t)(base + 8u);
    uint16_t interrupt_address = (uint16_t)(base + 0x0au);
    uint32_t memory = (uint32_t)(0xf800u + channel * 0x100u);
    Dspic33CanFrame input = frame(0x456u, false, false, 1u, 0x90u);
    uint8_t preparation = wrap ? 2u : 0u;
    uint8_t index;
    uint8_t expected_fbp = wrap ? 5u : 3u;
    uint8_t fnrb;
    bool asserted = relation == FIFO_RELATION_THRESHOLD;
    if (asserted) {
        fnrb = wrap ? 2u : 4u;
    } else if (relation == FIFO_RELATION_EQUAL) {
        fnrb = expected_fbp;
    } else {
        fnrb = wrap ? 3u : 5u;
    }
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, channel, memory, 1u, 2u);
    configure_filter(cpu, channel, 0u, input.identifier, false, 0x7ffu, true, 15u, 0u);
    enable_filter(cpu, channel, 1u);
    select_window(cpu, channel, false);
    set_mode(cpu, channel, 0u);
    for (index = 0u; index < preparation; index++) {
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "FIFO interrupt boundary preparation");
    }
    write_memory_word(
        cpu, fifo_address,
        (uint16_t)((dspic33_read_word(cpu, fifo_address) & 0x3f00u) | fnrb));
    dspic33_write_word(
        cpu, interrupt_address,
        (uint16_t)(dspic33_read_word(cpu, interrupt_address) & ~0x000au));
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 0x0008u);
    clear_interrupt_flag(cpu, event_irqs[channel]);
    expect(state,
           dspic33_can_receive(cpu, channel, &input, 0u) &&
               dspic33_device_advance(cpu, 32u),
           "FIFO interrupt boundary receive");
    expect(state,
           ((dspic33_read_word(cpu, fifo_address) >> 8u) & 0x003fu) == expected_fbp,
           "FIFO interrupt uses updated write pointer");
    expect(state, (dspic33_read_word(cpu, fifo_address) & 0x003fu) == fnrb,
           "FIFO interrupt preserves read pointer");
    expect(state,
           ((dspic33_read_word(cpu, interrupt_address) & 0x0008u) != 0u) == asserted,
           "FIFO interrupt boundary result");
    expect(state, interrupt_flag(cpu, event_irqs[channel]) == asserted,
           "FIFO interrupt boundary IFS result");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(base + 4u)) & 0x007fu) ==
               (asserted ? 0x44u : 0x40u),
           "FIFO interrupt boundary vector result");
}

static void fifo_interrupt_boundary_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t wrap;
        for (wrap = 0u; wrap < 2u; wrap++) {
            uint8_t relation;
            for (relation = FIFO_RELATION_THRESHOLD; relation <= FIFO_RELATION_DISTANT;
                 relation++) {
                fifo_interrupt_boundary_case(state, cpu, channel, wrap != 0u, relation);
            }
        }
    }
}

