tylertms/dspic33e-sim/tests/device/can_test.c
static void receive_flag_hardware_event_case(TestState* state, Dspic33* cpu,
                                             uint8_t channel, uint8_t target) {
    uint16_t base = bases[channel];
    uint16_t fifo_address = (uint16_t)(base + 8u);
    uint16_t interrupt_address = (uint16_t)(base + 0x0au);
    uint16_t overflow_address = (uint16_t)(base + 0x28u + (target >= 16u ? 2u : 0u));
    uint16_t target_bit = (uint16_t)(1u << (target & 15u));
    uint32_t memory = (uint32_t)(0xf000u + channel * 0x400u);
    uint16_t preserved_words[8];
    uint8_t buffer;
    uint8_t word;
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, channel, memory, 6u, target);
    configure_filter(cpu, channel, 0u, 0x456u, false, 0x7ffu, true, 15u, 0u);
    enable_filter(cpu, channel, 1u);
    select_window(cpu, channel, false);
    set_mode(cpu, channel, 0u);
    for (buffer = target; buffer < 32u; buffer++) {
        Dspic33CanFrame input =
            frame(0x456u, false, false, 1u, (uint8_t)(0x20u + buffer));
        uint8_t expected_fbp = buffer == 31u ? target : (uint8_t)(buffer + 1u);
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "receive flag hardware fill event");
        expect(state, receive_full(cpu, channel, buffer),
               "receive flag hardware sets RXFUL");
        expect(state,
               memory_word(cpu, memory + buffer * 16u + 6u) ==
                   (uint8_t)(0x20u + buffer),
               "receive flag hardware stores message");
        expect(state,
               ((dspic33_read_word(cpu, fifo_address) >> 8u) & 0x003fu) == expected_fbp,
               "receive flag hardware advances write pointer");
        expect(state, (dspic33_read_word(cpu, fifo_address) & 0x003fu) == target,
               "receive flag hardware preserves read pointer");
    }
    for (word = 0u; word < 8u; word++) {
        preserved_words[word] = memory_word(cpu, memory + target * 16u + word * 2u);
    }
    expect(state, (dspic33_read_word(cpu, overflow_address) & target_bit) == 0u,
           "receive overflow flag initially clear");
    expect(state, (dspic33_read_word(cpu, interrupt_address) & 0x0004u) == 0u,
           "receive overflow interrupt initially clear");
    {
        Dspic33CanFrame overflow = frame(0x456u, false, false, 1u, 0xe0u);
        uint8_t expected_fbp = target == 31u ? target : (uint8_t)(target + 1u);
        expect(state,
               dspic33_can_receive(cpu, channel, &overflow, 0u) &&
                   dspic33_device_advance(cpu, 2u),
               "receive overflow hardware event");
        expect(state, receive_full(cpu, channel, target),
               "receive overflow preserves RXFUL");
        expect(state, (dspic33_read_word(cpu, overflow_address) & target_bit) != 0u,
               "receive overflow hardware sets RXOVF");
        expect(state, (dspic33_read_word(cpu, interrupt_address) & 0x0004u) != 0u,
               "receive overflow hardware sets RBOVIF");
        expect(state,
               ((dspic33_read_word(cpu, fifo_address) >> 8u) & 0x003fu) == expected_fbp,
               "receive overflow advances write pointer");
        expect(state, (dspic33_read_word(cpu, fifo_address) & 0x003fu) == target,
               "receive overflow preserves read pointer");
        for (word = 0u; word < 8u; word++) {
            expect(state,
                   memory_word(cpu, memory + target * 16u + word * 2u) ==
                       preserved_words[word],
                   "receive overflow loses complete message");
        }
    }
}

static void receive_flag_hardware_event_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t target;
        for (target = 0u; target < 32u; target++) {
            receive_flag_hardware_event_case(state, cpu, channel, target);
        }
    }
}

static void overflow_and_fallback_cases(TestState* state, Dspic33* cpu) {
    Dspic33CanFrame input = frame(0x123u, false, false, 2u, 0x40u);
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, 0u, 0x8000u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, 0x123u, false, 0x7ffu, true, 1u, 0u);
    configure_filter(cpu, 0u, 1u, 0x123u, false, 0x7ffu, true, 2u, 0u);
    enable_filter(cpu, 0u, 3u);
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_receive(cpu, 0u, &input, 0u) && dspic33_device_advance(cpu, 32u),
           "fallback first transfer");
    expect(state, receive_full(cpu, 0u, 1u), "fallback first buffer");
    expect(state,
           dspic33_can_receive(cpu, 0u, &input, 0u) && dspic33_device_advance(cpu, 32u),
           "fallback second transfer");
    expect(state, receive_full(cpu, 0u, 2u), "fallback second buffer");
    expect(state,
           dspic33_can_receive(cpu, 0u, &input, 0u) && dspic33_device_advance(cpu, 2u),
           "fallback overflow attempt");
    expect(state, (dspic33_read_word(cpu, 0x0428u) & 2u) != 0u,
           "fallback lowest overflow");
}

static void transmission_cases(TestState* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t extended;
    uint8_t remote;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (extended = 0u; extended < 2u; extended++) {
            for (remote = 0u; remote < 2u; remote++) {
                uint16_t base = bases[channel];
                uint32_t memory = (uint32_t)(0x9000u + channel * 0x1000u);
                Dspic33CanFrame expected =
                    frame(extended != 0u ? 0x1234567u : 0x345u, extended != 0u,
                          remote != 0u, 8u, (uint8_t)(0x50u + extended * 8u));
                Dspic33CanFrame actual;
                uint16_t words[8] = {0};
                uint8_t index;
                uint32_t sid = expected.extended ? (expected.identifier >> 18u) & 0x7ffu
                                                 : expected.identifier;
                uint32_t eid = expected.identifier & 0x3ffffu;
                words[0] = (uint16_t)(sid << 2u);
                if (expected.extended) {
                    words[0] |= 3u;
                    words[1] = (uint16_t)(eid >> 6u);
                    words[2] = (uint16_t)((eid & 0x3fu) << 10u);
                    if (expected.remote) {
                        words[2] |= 0x0200u;
                    }
                } else if (expected.remote) {
                    words[0] |= 2u;
                }
                words[2] |= expected.length;
                for (index = 0u; index < expected.length; index++) {
                    words[3u + index / 2u] |= (uint16_t)expected.data[index]
                                              << ((index & 1u) * 8u);
                }
                dspic33_reset(cpu, 0u);
                configure_transmit(cpu, channel, memory);
                for (index = 0u; index < 8u; index++) {
                    write_memory_word(cpu, memory + index * 2u, words[index]);
                }
                select_window(cpu, channel, false);
                set_mode(cpu, channel, 0u);
                dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 1u);
                dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
                expect(state, dspic33_device_advance(cpu, 4096u), "transmit advance");
                expect(state, dspic33_can_transmit(cpu, channel, &actual),
                       "transmit queue output");
                expect(state,
                       actual.identifier == expected.identifier &&
                           actual.extended == expected.extended &&
                           actual.remote == expected.remote &&
                           actual.length == expected.length,
                       "transmit frame header");
                expect(state, memcmp(actual.data, expected.data, 8u) == 0,
                       "transmit payload");
                expect(state,
                       (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 8u) == 0u,
                       "transmit request clear");
                expect(state,
                       (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 1u) != 0u,
                       "transmit event flag");
                expect(state, interrupt_flag(cpu, event_irqs[channel]),
                       "transmit event interrupt");
            }
        }
    }
}

