tylertms/dspic33e-sim/tests/device/can_test.c
static void clock_timing_cases(TestState* state, Dspic33* cpu) {
    static const uint16_t clock_controls[] = {0u, 0x0800u, 0u, 0u};
    static const uint16_t config1_values[] = {0u, 0u, 1u, 0u};
    static const uint16_t config2_values[] = {0u, 0u, 0u, 0x0311u};
    static const uint64_t completion_cycles[] = {208u, 408u, 408u, 508u};
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (uint8_t timing = 0u;
             timing < sizeof(completion_cycles) / sizeof(completion_cycles[0]);
             timing++) {
            uint16_t base = bases[channel];
            uint32_t memory = (uint32_t)(0xb800u + channel * 0x100u);
            Dspic33CanFrame output;
            dspic33_reset(cpu, 0u);
            configure_transmit(cpu, channel, memory);
            write_memory_word(cpu, memory, 2u);
            for (uint8_t word = 1u; word < 8u; word++) {
                write_memory_word(cpu, memory + word * 2u, 0u);
            }
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 4u);
            dspic33_write_word(cpu, (uint16_t)(base + 0x10u), config1_values[timing]);
            dspic33_write_word(cpu, (uint16_t)(base + 0x12u), config2_values[timing]);
            dspic33_write_word(cpu, base,
                               (uint16_t)((dspic33_read_word(cpu, base) & ~0x0800u) |
                                          clock_controls[timing]));
            set_mode(cpu, channel, 0u);
            dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + 0x10u)) ==
                           config1_values[timing] &&
                       dspic33_read_word(cpu, (uint16_t)(base + 0x12u)) ==
                           config2_values[timing] &&
                       (dspic33_read_word(cpu, base) & 0x0800u) ==
                           clock_controls[timing],
                   "CAN bit timing configuration is retained");
            expect(state,
                   dspic33_device_advance(cpu, completion_cycles[timing] - 1u) &&
                       !dspic33_can_transmit(cpu, channel, &output),
                   "CAN frame remains active before its final bus bit");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       dspic33_can_transmit(cpu, channel, &output) &&
                       output.identifier == 0u && output.remote && output.length == 0u,
                   "CAN frame completes on its configured B1 clock boundary");
        }
    }
}

static void stuffed_frame_timing_cases(TestState* state, Dspic33* cpu) {
    static const uint16_t words[][8] = {
        {0x0c84u, 0u, 1u, 0x00a5u, 0u, 0u, 0u, 0u},
        {0x0123u, 0x0d15u, 0x9c08u, 0x0100u, 0x0302u, 0x0504u, 0x0706u, 0u},
    };
    static const uint64_t completion_cycles[] = {236u, 576u};
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (uint8_t frame_index = 0u;
             frame_index < sizeof(completion_cycles) / sizeof(completion_cycles[0]);
             frame_index++) {
            uint16_t base = bases[channel];
            uint32_t memory = (uint32_t)(0xba00u + channel * 0x100u);
            Dspic33CanFrame output;
            dspic33_reset(cpu, 0u);
            configure_transmit(cpu, channel, memory);
            for (uint8_t word = 0u; word < 8u; word++) {
                write_memory_word(cpu, memory + word * 2u, words[frame_index][word]);
            }
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 0u);
            dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
            expect(state,
                   dspic33_device_advance(cpu, completion_cycles[frame_index] - 1u) &&
                       !dspic33_can_transmit(cpu, channel, &output),
                   "stuffed CAN frame remains active before its calculated boundary");
            expect(state,
                   dspic33_device_advance(cpu, 1u) &&
                       dspic33_can_transmit(cpu, channel, &output) &&
                       output.extended == (frame_index != 0u) &&
                       output.length == (frame_index == 0u ? 1u : 8u),
                   "stuffed CAN frame completes on its calculated boundary");
        }
    }
}

static void transmit_abort_timing_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xbc00u + channel * 0x100u);
        Dspic33CanFrame output;
        dspic33_reset(cpu, 0u);
        configure_transmit(cpu, channel, memory);
        write_memory_word(cpu, memory, 2u);
        for (uint8_t word = 1u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) != 0u &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "CAN abort test reaches the on-bus interval");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) | 0x1000u));
        expect(state,
               (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 0x0048u) ==
                       0x0040u &&
                   dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "CAN abort cancels the pending on-bus completion");

        dspic33_reset(cpu, 0u);
        configure_transmit(cpu, channel, memory);
        write_memory_word(cpu, memory, 2u);
        for (uint8_t word = 1u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) != 0u,
               "individual CAN abort reaches the on-bus interval");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x0083u);
        expect(state,
               (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 0x0048u) ==
                       0x0040u &&
                   dspic33_device_advance(cpu, 1000u) &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "clearing TXREQ aborts the active CAN transmission");
    }
}

static void transmit_pps_cases(TestState* state, Dspic33* cpu) {
    bool high;
    expect(state, !dspic33_can_pin(cpu, 64u, NULL),
           "CAN output rejects null pin level");
    expect(state, !dspic33_can_pin(cpu, 63u, &high),
           "CAN output rejects non-remappable pin");
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xbe00u + channel * 0x100u);
        uint8_t function = (uint8_t)(14u + channel);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0680u, function);
        expect(state, dspic33_can_pin(cpu, 64u, &high) && high,
               "mapped CAN transmit pin is recessive while idle");
        configure_transmit(cpu, channel, memory);
        for (uint8_t word = 0u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) && dspic33_can_pin(cpu, 64u, &high) &&
                   !high,
               "CAN transmit pin drives dominant start of frame");
        expect(state,
               dspic33_device_advance(cpu, 20u) && dspic33_can_pin(cpu, 64u, &high) &&
                   high,
               "CAN transmit pin inserts the sixth complementary stuffed bit");
        expect(state,
               dspic33_device_advance(cpu, 4u) && dspic33_can_pin(cpu, 64u, &high) &&
                   !high,
               "CAN transmit pin resumes frame data after stuffing");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x0083u);
        expect(state, dspic33_can_pin(cpu, 64u, &high) && high,
               "aborted CAN transmit pin returns recessive");
        dspic33_write_word(cpu, 0x0680u, (uint16_t)(function << 8u));
        expect(state,
               !dspic33_can_pin(cpu, 64u, &high) && dspic33_can_pin(cpu, 65u, &high) &&
                   high,
               "CAN transmit output follows PPS remapping");
        dspic33_write_word(
            cpu, 0x0760u,
            (uint16_t)(dspic33_read_word(cpu, 0x0760u) | (uint16_t)(2u << channel)));
        expect(state,
               dspic33_device_advance(cpu, 1u) && !dspic33_can_pin(cpu, 65u, &high),
               "PMD releases the CAN transmit PPS output");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0680u, function);
        configure_transmit(cpu, channel, memory);
        for (uint8_t word = 0u; word < 8u; word++) {
            write_memory_word(cpu, memory + word * 2u, 0u);
        }
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) && dspic33_can_pin(cpu, 64u, &high) &&
                   !high,
               "CAN Sleep output test reaches dominant bus phase");
        cpu->power_state = DSPIC33_POWER_SLEEP;
        expect(state, dspic33_can_pin(cpu, 64u, &high) && high,
               "Sleep forces the CAN transmit pin recessive");
    }
}

static bool bridge_can_pins(Dspic33* cpu, uint8_t transmit_channel, uint8_t pin,
                            uint8_t acknowledge_pin, uint64_t bit_cycles,
                            int corrupt_bit, bool* acknowledge_observed) {
    uint16_t bit = 0u;
    while ((cpu->io.can_tx_on_bus & (uint8_t)(1u << transmit_channel)) != 0u &&
           bit < 160u) {
        bool high;
        bool acknowledge_high;
        if (dspic33_can_pin(cpu, acknowledge_pin, &acknowledge_high) &&
            !acknowledge_high) {
            *acknowledge_observed = true;
        }
        if (!dspic33_can_pin(cpu, pin, &high)) {
            return false;
        }
        if (bit == corrupt_bit) {
            high = !high;
        }
        if (!dspic33_can_input_pin(cpu, pin, high && acknowledge_high, 0u) ||
            !dspic33_device_advance(cpu, bit_cycles)) {
            return false;
        }
        bit++;
    }
    return bit != 0u && bit < 160u && dspic33_device_advance(cpu, 32u);
}

static bool bridge_can_with_final_sample_glitch(
    Dspic33* cpu, uint8_t transmit_channel, uint8_t transmit_pin,
    uint8_t acknowledge_pin, uint8_t transmit_receive_pin, uint8_t receive_pin,
    bool glitch_transmitter, bool* acknowledge_observed) {
    uint16_t bit = 0u;
    while ((cpu->io.can_tx_on_bus & (uint8_t)(1u << transmit_channel)) != 0u &&
           bit < 160u) {
        bool transmit_high;
        bool acknowledge_high;
        bool bus_high;
        if (dspic33_can_pin(cpu, acknowledge_pin, &acknowledge_high) &&
            !acknowledge_high) {
            *acknowledge_observed = true;
        }
        if (!dspic33_can_pin(cpu, transmit_pin, &transmit_high)) {
            return false;
        }
        bus_high = transmit_high && acknowledge_high;
        if (!dspic33_can_input_pin(cpu, transmit_receive_pin, bus_high, 0u) ||
            !dspic33_can_input_pin(cpu, receive_pin, bus_high, 0u) ||
            !dspic33_device_advance(cpu, 2u)) {
            return false;
        }
        if (bit == 0u &&
            !dspic33_can_input_pin(
                cpu, glitch_transmitter ? transmit_receive_pin : receive_pin, !bus_high,
                0u)) {
            return false;
        }
        if (!dspic33_device_advance(cpu, 1u) ||
            !dspic33_can_input_pin(
                cpu, glitch_transmitter ? transmit_receive_pin : receive_pin, bus_high,
                0u) ||
            !dspic33_device_advance(cpu, 1u)) {
            return false;
        }
        bit++;
    }
    return bit != 0u && bit < 160u && dspic33_device_advance(cpu, 32u);
}

static void triple_sample_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t glitch_transmitter = 0u; glitch_transmitter < 2u;
         glitch_transmitter++) {
        Dspic33CanFrame input =
            frame((uint32_t)(0x360u + glitch_transmitter), false, false, 2u,
                  (uint8_t)(0x80u + glitch_transmitter * 0x10u));
        Dspic33CanFrame output;
        bool acknowledge_observed = false;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
        dspic33_write_word(cpu, 0x06d4u, 0x4042u);
        configure_receive(cpu, 1u, 0xda00u, 4u, 0u);
        configure_filter(cpu, 1u, 0u, input.identifier, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, 1u, 1u);
        configure_transmit(cpu, 0u, 0xd800u);
        write_transmit_frame(cpu, 0xd800u, &input);
        select_window(cpu, 0u, false);
        select_window(cpu, 1u, false);
        dspic33_write_word(cpu, 0x0410u, 0u);
        dspic33_write_word(cpu, 0x0412u, glitch_transmitter != 0u ? 0x0040u : 0u);
        dspic33_write_word(cpu, 0x0510u, 0u);
        dspic33_write_word(cpu, 0x0512u, glitch_transmitter == 0u ? 0x0040u : 0u);
        set_mode(cpu, 0u, 0u);
        set_mode(cpu, 1u, 0u);
        dspic33_write_word(cpu, 0x0430u, 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   bridge_can_with_final_sample_glitch(cpu, 0u, 64u, 65u, 66u, 64u,
                                                       glitch_transmitter != 0u,
                                                       &acknowledge_observed),
               "CAN triple-sample bridge tolerates one final-sample glitch");
        expect(state,
               receive_full(cpu, 1u, 0u) &&
                   (dspic33_read_word(cpu, 0x050eu) & 0x00ffu) == 0u &&
                   memory_word(cpu, 0xda00u) == (uint16_t)(input.identifier << 2u) &&
                   (uint8_t)memory_word(cpu, 0xda06u) == input.data[0] &&
                   (uint8_t)(memory_word(cpu, 0xda06u) >> 8u) == input.data[1],
               "CAN triple-sample receiver uses the majority value");
        expect(state,
               acknowledge_observed && dspic33_can_transmit(cpu, 0u, &output) &&
                   output.identifier == input.identifier &&
                   (dspic33_read_word(cpu, 0x040eu) >> 8u) == 0u &&
                   (dspic33_read_word(cpu, 0x0430u) & 0x0018u) == 0u,
               "CAN triple-sample transmitter uses the majority value");
    }
}

static void prepare_resynchronization(Dspic33* cpu, uint16_t config1) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    dspic33_write_word(cpu, 0x0410u, config1);
    dspic33_write_word(cpu, 0x0412u, 0u);
    set_mode(cpu, 0u, 0u);
    dspic33_can_input_pin(cpu, 64u, false, 0u);
    dspic33_device_advance(cpu, 3u);
    dspic33_can_input_pin(cpu, 64u, true, 0u);
    dspic33_device_advance(cpu, 0u);
}

static void resynchronization_cases(TestState* state, Dspic33* cpu) {
    prepare_resynchronization(cpu, 0u);
    expect(state,
           cpu->io.can_rx_serial_count[0] == 1u &&
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 2u) && cpu->io.can_rx_serial_count[0] == 1u,
           "early CAN edge shortens Phase Segment 2");
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.can_rx_serial_count[0] == 2u,
           "early CAN edge advances the next sample point by one TQ");

    prepare_resynchronization(cpu, 0u);
    expect(state,
           dspic33_device_advance(cpu, 3u) &&
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 1u) && cpu->io.can_rx_serial_count[0] == 1u,
           "late CAN edge lengthens Phase Segment 1");
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.can_rx_serial_count[0] == 2u,
           "one-TQ SJW limits a late CAN resynchronization");

    prepare_resynchronization(cpu, 0x0040u);
    expect(state,
           dspic33_device_advance(cpu, 3u) &&
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 2u) && cpu->io.can_rx_serial_count[0] == 1u,
           "two-TQ SJW permits a larger CAN phase correction");
    expect(state,
           dspic33_device_advance(cpu, 1u) && cpu->io.can_rx_serial_count[0] == 2u,
           "two-TQ CAN resynchronization reaches its adjusted sample point");
}

static bool drive_can_to_intermission(Dspic33* cpu) {
    for (uint16_t bit = 0u; bit < 160u; bit++) {
        bool transmit_high;
        bool acknowledge_high;
        if ((cpu->io.can_intermission_active & 2u) != 0u) {
            return true;
        }
        if (!dspic33_can_pin(cpu, 64u, &transmit_high) ||
            !dspic33_can_pin(cpu, 65u, &acknowledge_high) ||
            !dspic33_can_input_pin(cpu, 66u, transmit_high && acknowledge_high, 0u) ||
            !dspic33_can_input_pin(cpu, 64u, transmit_high && acknowledge_high, 0u) ||
            !dspic33_device_advance(cpu, 4u)) {
            return false;
        }
    }
    return false;
}

static void overload_frame_cases(TestState* state, Dspic33* cpu) {
    Dspic33CanFrame input = frame(0x365u, false, false, 1u, 0xa0u);
    bool high;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
    dspic33_write_word(cpu, 0x06d4u, 0x4042u);
    configure_receive(cpu, 1u, 0xda00u, 4u, 0u);
    configure_filter(cpu, 1u, 0u, input.identifier, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 1u, 1u);
    configure_transmit(cpu, 0u, 0xd800u);
    write_transmit_frame(cpu, 0xd800u, &input);
    select_window(cpu, 0u, false);
    select_window(cpu, 1u, false);
    dspic33_write_word(cpu, 0x0410u, 0u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    dspic33_write_word(cpu, 0x0510u, 0u);
    dspic33_write_word(cpu, 0x0512u, 0u);
    set_mode(cpu, 0u, 0u);
    set_mode(cpu, 1u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    expect(state, dspic33_device_advance(cpu, 8u),
           "CAN overload source reaches the bus");
    expect(state, drive_can_to_intermission(cpu),
           "valid CAN frame reaches Intermission");
    expect(state, cpu->io.can_rx_serial_count[1] != 0u,
           "valid CAN serial frame completes before Intermission");
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               dspic33_can_input_pin(cpu, 64u, true, 0u) &&
               dspic33_device_advance(cpu, 0u) && dspic33_can_pin(cpu, 65u, &high) &&
               !high && cpu->io.can_overload_count[1] == 1u,
           "dominant Intermission edge starts a CAN overload flag");
    expect(state,
           dspic33_device_advance(cpu, 23u) && dspic33_can_pin(cpu, 65u, &high) &&
               !high,
           "CAN overload flag remains dominant for six bits");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_can_pin(cpu, 65u, &high) && high,
           "CAN overload delimiter becomes recessive after six bits");
    expect(state,
           dspic33_device_advance(cpu, 32u) &&
               (cpu->io.can_intermission_active & 2u) != 0u,
           "CAN overload delimiter is followed by Intermission");
    expect(
        state,
        dspic33_can_input_pin(cpu, 64u, false, 0u) && dspic33_device_advance(cpu, 0u) &&
            dspic33_can_input_pin(cpu, 64u, true, 0u) &&
            dspic33_device_advance(cpu, 56u) && cpu->io.can_overload_count[1] == 2u &&
            (cpu->io.can_intermission_active & 2u) != 0u,
        "CAN permits two sequential overload frames");
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) && dspic33_can_pin(cpu, 65u, &high) &&
               high && (cpu->io.can_overload_active & 2u) == 0u,
           "CAN suppresses a third sequential overload frame");
}

static bool drive_shared_can_bus(Dspic33* can1, Dspic33* can2, uint8_t active_channel,
                                 uint64_t bit_cycles) {
    uint16_t count = 0u;
    Dspic33* active = active_channel == 0u ? can1 : can2;
    while ((active->io.can_tx_on_bus & (uint8_t)(1u << active_channel)) != 0u &&
           count < 160u) {
        bool can1_high;
        bool can2_high;
        bool bus_high;
        if (!dspic33_can_pin(can1, 65u, &can1_high) ||
            !dspic33_can_pin(can2, 66u, &can2_high)) {
            return false;
        }
        bus_high = can1_high && can2_high;
        if (!dspic33_can_input_pin(can1, 64u, bus_high, 0u) ||
            !dspic33_can_input_pin(can2, 64u, bus_high, 0u) ||
            !dspic33_device_advance(can1, bit_cycles) ||
            !dspic33_device_advance(can2, bit_cycles)) {
            return false;
        }
        count++;
    }
    return count != 0u && count < 160u;
}

