tylertms/dspic33e-sim/tests/device/can_test.c
static void arbitration_field_cases(TestState* state, Dspic33* cpu) {
    Dspic33CanFrame contenders[4][2];
    Dspic33 winner;
    contenders[0][0] = frame(0x155u, false, false, 0u, 0u);
    contenders[0][1] = frame(0x155u, false, true, 0u, 0u);
    contenders[1][0] = frame(0x155u, false, false, 0u, 0u);
    contenders[1][1] = frame(0x5540000u, true, false, 0u, 0u);
    contenders[2][0] = frame(0x1550000u, true, false, 0u, 0u);
    contenders[2][1] = frame(0x1550001u, true, false, 0u, 0u);
    contenders[3][0] = frame(0x1550000u, true, false, 0u, 0u);
    contenders[3][1] = frame(0x1550000u, true, true, 0u, 0u);
    expect(state, dspic33_initialize(&winner),
           "initialize independent CAN arbitration contender");
    for (uint8_t index = 0u; index < 4u; index++) {
        Dspic33CanFrame output;
        dspic33_reset(cpu, 0u);
        dspic33_reset(&winner, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, 0x0e00u);
        dspic33_write_word(cpu, 0x06d4u, 0x0040u);
        dspic33_write_word(&winner, 0x0e30u, 0xffffu);
        dspic33_write_word(&winner, 0x0e3eu, 0u);
        dspic33_write_word(&winner, 0x0682u, 0x000fu);
        dspic33_write_word(&winner, 0x06d4u, 0x4000u);
        configure_transmit(cpu, 0u, 0xd400u);
        configure_transmit(&winner, 1u, 0xd600u);
        write_transmit_frame(cpu, 0xd400u, &contenders[index][0]);
        write_transmit_frame(&winner, 0xd600u, &contenders[index][1]);
        select_window(cpu, 0u, false);
        select_window(&winner, 1u, false);
        dspic33_write_word(cpu, 0x0410u, 0u);
        dspic33_write_word(cpu, 0x0412u, 0u);
        dspic33_write_word(&winner, 0x0510u, 0u);
        dspic33_write_word(&winner, 0x0512u, 0u);
        set_mode(cpu, 0u, 0u);
        set_mode(&winner, 1u, 0u);
        dspic33_write_word(cpu, 0x0430u, 0x008bu);
        dspic33_write_word(&winner, 0x0530u, 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) && dspic33_device_advance(&winner, 8u) &&
                   (cpu->io.can_tx_on_bus & 1u) != 0u &&
                   (winner.io.can_tx_on_bus & 2u) != 0u,
               "CAN arbitration field contenders start together");
        expect(state, drive_shared_can_bus(cpu, &winner, 0u, 4u),
               "CAN arbitration field selects the dominant contender");
        expect(state,
               (dspic33_read_word(&winner, 0x0530u) & 0x0028u) == 0x0028u &&
                   dspic33_can_transmit(cpu, 0u, &output) &&
                   output.identifier == contenders[index][0].identifier &&
                   output.extended == contenders[index][0].extended &&
                   output.remote == contenders[index][0].remote,
               "CAN arbitration field records loss and completes the winner");
    }
    dspic33_destroy(&winner);
}

static void arbitration_cases(TestState* state, Dspic33* cpu) {
    Dspic33CanFrame higher = frame(0x400u, false, false, 2u, 0xa0u);
    Dspic33CanFrame lower = frame(0u, false, false, 2u, 0xb0u);
    Dspic33CanFrame output;
    Dspic33 winner;
    expect(state, dspic33_initialize(&winner),
           "initialize independent CAN arbitration winner");
    dspic33_reset(cpu, 0u);
    dspic33_reset(&winner, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 0x0e00u);
    dspic33_write_word(cpu, 0x06d4u, 0x0040u);
    dspic33_write_word(&winner, 0x0e30u, 0xffffu);
    dspic33_write_word(&winner, 0x0e3eu, 0u);
    dspic33_write_word(&winner, 0x0682u, 0x000fu);
    dspic33_write_word(&winner, 0x06d4u, 0x4000u);
    configure_receive(cpu, 0u, 0xd000u, 4u, 0u);
    configure_receive(&winner, 1u, 0xd200u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, lower.identifier, false, 0x7ffu, true, 0u, 0u);
    configure_filter(&winner, 1u, 0u, higher.identifier, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 0u, 1u);
    enable_filter(&winner, 1u, 1u);
    configure_transmit(cpu, 0u, 0xd400u);
    configure_transmit(&winner, 1u, 0xd600u);
    write_transmit_frame(cpu, 0xd400u, &higher);
    write_transmit_frame(&winner, 0xd600u, &lower);
    select_window(cpu, 0u, false);
    select_window(&winner, 1u, false);
    dspic33_write_word(cpu, 0x0410u, 0u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    dspic33_write_word(&winner, 0x0510u, 0u);
    dspic33_write_word(&winner, 0x0512u, 0u);
    set_mode(cpu, 0u, 0u);
    set_mode(&winner, 1u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    dspic33_write_word(&winner, 0x0530u, 0x008bu);
    expect(state,
           dspic33_device_advance(cpu, 8u) && dspic33_device_advance(&winner, 8u) &&
               (cpu->io.can_tx_on_bus & 1u) != 0u &&
               (winner.io.can_tx_on_bus & 2u) != 0u,
           "competing CAN transmissions enter the bus together");
    expect(state, drive_shared_can_bus(cpu, &winner, 1u, 4u),
           "lower identifier wins CAN arbitration");
    expect(state,
           (dspic33_read_word(cpu, 0x0430u) & 0x0028u) == 0x0028u &&
               (cpu->io.can_tx_busy & 1u) != 0u && (cpu->io.can_tx_on_bus & 1u) == 0u &&
               !dspic33_can_transmit(cpu, 0u, &output),
           "losing CAN transmission records TXLARB and begins an automatic retry");
    expect(state,
           dspic33_can_transmit(&winner, 1u, &output) &&
               output.identifier == lower.identifier,
           "winning CAN frame completes before the retry");
    expect(state,
           cpu->io.can_rx_serial_count[0] != 0u && dspic33_device_advance(cpu, 7u) &&
               dspic33_device_advance(&winner, 7u) &&
               (cpu->io.can_tx_retry_wait & 1u) == 0u &&
               (cpu->io.can_tx_on_bus & 1u) != 0u,
           "losing node monitors the winner and retries after intermission");
    expect(state, drive_shared_can_bus(cpu, &winner, 0u, 4u),
           "retried CAN transmission completes on the shared bus");
    expect(state,
           dspic33_device_advance(cpu, 8u) && dspic33_can_transmit(cpu, 0u, &output) &&
               output.identifier == higher.identifier &&
               (dspic33_read_word(cpu, 0x0430u) & 0x0078u) == 0x0020u &&
               winner.io.can_rx_serial_count[1] != 0u,
           "successful retry preserves TXLARB and clears TXREQ without errors");
    dspic33_destroy(&winner);
}

static bool drive_unacknowledged_can_frame(Dspic33* cpu, uint8_t channel,
                                           uint8_t transmit_pin, uint8_t receive_pin,
                                           uint64_t bit_cycles) {
    uint16_t count = 0u;
    while ((cpu->io.can_tx_on_bus & (uint8_t)(1u << channel)) != 0u && count < 160u) {
        bool high;
        if (!dspic33_can_pin(cpu, transmit_pin, &high) ||
            !dspic33_can_input_pin(cpu, receive_pin, high, 0u) ||
            !dspic33_device_advance(cpu, bit_cycles)) {
            return false;
        }
        count++;
    }
    return count != 0u && count < 160u;
}

static void acknowledge_error_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xdc00u + channel * 0x100u);
        uint8_t function = (uint8_t)(14u + channel);
        Dspic33CanFrame output;
        bool high;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, function);
        dspic33_write_word(cpu, 0x06d4u, channel == 0u ? 65u : (uint16_t)(65u << 8u));
        configure_transmit(cpu, channel, memory);
        Dspic33CanFrame input = frame((uint32_t)(0x240u + channel), false, false, 1u,
                                      (uint8_t)(0xc0u + channel));
        write_transmit_frame(cpu, memory, &input);
        select_window(cpu, channel, false);
        dspic33_write_word(cpu, (uint16_t)(base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x12u), 0u);
        set_mode(cpu, channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   (cpu->io.can_tx_on_bus & (uint8_t)(1u << channel)) != 0u,
               "unacknowledged CAN frame reaches the bus");
        expect(state, drive_unacknowledged_can_frame(cpu, channel, 64u, 65u, 4u),
               "unacknowledged CAN frame reaches the ACK slot");
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 0x0018u) ==
                       0x0018u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) >> 8u) == 8u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 1u) == 0u &&
                   (cpu->io.can_tx_error_active & (uint8_t)(1u << channel)) != 0u &&
                   !dspic33_can_transmit(cpu, channel, &output),
               "missing CAN ACK sets TXERR and TEC without completing transmission");
        expect(state, dspic33_can_pin(cpu, 64u, &high) && !high,
               "CAN acknowledge error emits an active error flag");
        if (channel == 0u) {
            Dspic33 copy;
            bool copy_high;
            expect(state, dspic33_initialize(&copy), "initialize CAN error-frame copy");
            expect(state,
                   dspic33_copy(&copy, cpu) && copy.io.can_tx_error_active == 1u &&
                       copy.io.can_tx_error_start_cycle[0] ==
                           cpu->io.can_tx_error_start_cycle[0],
                   "copy preserves active CAN error-frame phase");
            expect(state,
                   dspic33_device_advance(cpu, 24u) &&
                       dspic33_device_advance(&copy, 24u) &&
                       dspic33_can_pin(cpu, 64u, &high) && high &&
                       dspic33_can_pin(&copy, 64u, &copy_high) && copy_high &&
                       copy.io.can_tx_error_active == 1u,
                   "copied CAN error frames enter the recessive delimiter together");
            dspic33_destroy(&copy);
        } else {
            expect(state,
                   dspic33_device_advance(cpu, 24u) &&
                       dspic33_can_pin(cpu, 64u, &high) && high &&
                       (cpu->io.can_tx_error_active & (uint8_t)(1u << channel)) != 0u,
                   "CAN active error flag is followed by a recessive delimiter");
        }
        expect(
            state,
            dspic33_device_advance(cpu, 52u) &&
                (cpu->io.can_tx_error_active & (uint8_t)(1u << channel)) == 0u &&
                (cpu->io.can_tx_on_bus & (uint8_t)(1u << channel)) != 0u,
            "unacknowledged CAN transmission automatically retries after intermission");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x0093u);
        expect(state,
               (cpu->io.can_tx_busy & (uint8_t)(1u << channel)) == 0u &&
                   (cpu->io.can_tx_retry_wait & (uint8_t)(1u << channel)) == 0u &&
                   dspic33_can_pin(cpu, 64u, &high) && high,
               "aborting a retried CAN frame clears error-bus state");
    }
}

static void transmit_error_variant_cases(TestState* state, Dspic33* cpu) {
    bool high;
    Dspic33CanFrame input = frame(0u, false, false, 0u, 0u);
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 14u);
    dspic33_write_word(cpu, 0x06d4u, 65u);
    configure_transmit(cpu, 0u, 0xdc00u);
    write_transmit_frame(cpu, 0xdc00u, &input);
    select_window(cpu, 0u, false);
    dspic33_write_word(cpu, 0x0410u, 0u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    expect(state,
           dspic33_device_advance(cpu, 8u) && dspic33_can_pin(cpu, 64u, &high) && !high,
           "CAN dominant-bit mismatch test reaches SOF");
    expect(state,
           dspic33_can_input_pin(cpu, 65u, true, 0u) && dspic33_device_advance(cpu, 4u),
           "CAN transmitter samples recessive while driving dominant");
    expect(state,
           (dspic33_read_word(cpu, 0x0430u) & 0x0038u) == 0x0018u &&
               (dspic33_read_word(cpu, 0x040eu) >> 8u) == 8u &&
               (cpu->io.can_tx_error_active & 1u) != 0u,
           "dominant CAN mismatch is a bit error rather than arbitration loss");
    expect(state, dspic33_can_pin(cpu, 64u, &high) && !high,
           "active CAN bit error drives a dominant error flag");
    dspic33_write_word(cpu, 0x0430u, 0x0093u);

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 14u);
    dspic33_write_word(cpu, 0x06d4u, 65u);
    configure_transmit(cpu, 0u, 0xdc00u);
    write_transmit_frame(cpu, 0xdc00u, &input);
    select_window(cpu, 0u, false);
    dspic33_write_word(cpu, 0x0410u, 0u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_error(cpu, 0u, true, 120u, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x040eu) >> 8u) == 120u,
           "CAN transmitter reaches the error-passive boundary precursor");
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    expect(state,
           dspic33_device_advance(cpu, 8u) &&
               drive_unacknowledged_can_frame(cpu, 0u, 64u, 65u, 4u),
           "error-passive CAN transmitter encounters a missing ACK");
    expect(state,
           (dspic33_read_word(cpu, 0x040eu) >> 8u) == 128u &&
               (dspic33_read_word(cpu, 0x040au) & 0x1000u) != 0u &&
               (dspic33_read_word(cpu, 0x0430u) & 0x0018u) == 0x0018u,
           "missing ACK transitions the CAN transmitter to error-passive");
    expect(state,
           dspic33_can_pin(cpu, 64u, &high) && high &&
               (cpu->io.can_tx_error_active & 1u) != 0u,
           "error-passive CAN flag remains recessive");
    expect(state, dspic33_device_advance(cpu, 99u),
           "error-passive CAN Suspend Transmission advances");
    expect(state, (cpu->io.can_tx_error_active & 1u) != 0u,
           "error-passive CAN flag remains active through Suspend Transmission");
    expect(state, (cpu->io.can_tx_on_bus & 1u) == 0u,
           "error-passive CAN transmitter remains off-bus during suspension");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               (cpu->io.can_tx_error_active & 1u) == 0u &&
               (cpu->io.can_tx_on_bus & 1u) == 0u,
           "error-passive CAN suspension ends after eight additional bits");
    expect(state, dspic33_device_advance(cpu, 8u) && (cpu->io.can_tx_on_bus & 1u) != 0u,
           "error-passive CAN transmission retries after suspension");
    dspic33_write_word(cpu, 0x0430u, 0x0093u);
    expect(state,
           cpu->io.can_tx_busy == 0u && cpu->io.can_tx_retry_wait == 0u &&
               dspic33_can_pin(cpu, 64u, &high) && high,
           "aborting an error-passive retry releases the CAN bus");
}

static bool drive_until_receive_error(Dspic33* cpu, uint16_t corrupt_bit) {
    for (uint16_t bit = 0u; bit < 160u; bit++) {
        bool transmit_high;
        bool receive_high;
        if ((cpu->io.can_rx_error_active & 2u) != 0u) {
            return true;
        }
        if (!dspic33_can_pin(cpu, 64u, &transmit_high) ||
            !dspic33_can_pin(cpu, 65u, &receive_high)) {
            return false;
        }
        if (bit == corrupt_bit) {
            transmit_high = !transmit_high;
        }
        if (!dspic33_can_input_pin(cpu, 64u, transmit_high && receive_high, 0u) ||
            !dspic33_device_advance(cpu, 4u)) {
            return false;
        }
    }
    return false;
}

static void receive_error_cases(TestState* state, Dspic33* cpu) {
    static const uint16_t corrupt_bits[] = {5u, 30u, 42u};
    for (uint8_t index = 0u; index < 3u; index++) {
        bool high;
        Dspic33CanFrame input = frame(0u, false, false, 0u, 0u);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
        dspic33_write_word(cpu, 0x06d4u, 0x4000u);
        configure_transmit(cpu, 0u, 0xde00u);
        write_transmit_frame(cpu, 0xde00u, &input);
        select_window(cpu, 0u, false);
        select_window(cpu, 1u, false);
        dspic33_write_word(cpu, 0x0410u, 0u);
        dspic33_write_word(cpu, 0x0412u, 0u);
        dspic33_write_word(cpu, 0x0510u, 0u);
        dspic33_write_word(cpu, 0x0512u, 0u);
        set_mode(cpu, 0u, 0u);
        set_mode(cpu, 1u, 0u);
        dspic33_write_word(cpu, 0x0430u, 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   drive_until_receive_error(cpu, corrupt_bits[index]),
               "physical CAN corruption activates receiver error handling");
        expect(state,
               (dspic33_read_word(cpu, 0x050eu) & 0x00ffu) == 1u &&
                   (dspic33_read_word(cpu, 0x050au) & 0x0080u) != 0u &&
                   (dspic33_read_word(cpu, 0x050au) & 0x0020u) == 0u &&
                   !receive_full(cpu, 1u, 0u),
               "CAN receiver error updates REC and IVRIF without B1 ERRIF");
        expect(state, dspic33_can_pin(cpu, 65u, &high) && !high,
               "error-active CAN receiver drives a dominant error flag");
        dspic33_write_word(cpu, 0x0430u, 0x0083u);
        expect(state,
               dspic33_device_advance(cpu, 24u) && dspic33_can_pin(cpu, 65u, &high) &&
                   high && dspic33_device_advance(cpu, 32u) &&
                   (cpu->io.can_rx_error_active & 2u) == 0u,
               "CAN receiver error flag ends after its delimiter");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
    dspic33_write_word(cpu, 0x06d4u, 0x4000u);
    configure_transmit(cpu, 0u, 0xde00u);
    Dspic33CanFrame passive = frame(0u, false, false, 0u, 0u);
    write_transmit_frame(cpu, 0xde00u, &passive);
    select_window(cpu, 0u, false);
    select_window(cpu, 1u, false);
    dspic33_write_word(cpu, 0x0410u, 0u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    dspic33_write_word(cpu, 0x0510u, 0u);
    dspic33_write_word(cpu, 0x0512u, 0u);
    set_mode(cpu, 0u, 0u);
    set_mode(cpu, 1u, 0u);
    expect(state,
           dspic33_can_error(cpu, 1u, false, 127u, 0u) &&
               dspic33_device_advance(cpu, 0u),
           "CAN receiver reaches the error-passive boundary precursor");
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    expect(state,
           dspic33_device_advance(cpu, 8u) && drive_until_receive_error(cpu, 5u) &&
               (dspic33_read_word(cpu, 0x050eu) & 0x00ffu) == 128u &&
               (dspic33_read_word(cpu, 0x050au) & 0x0800u) != 0u,
           "physical CAN corruption transitions the receiver to error-passive");
    bool high;
    expect(state,
           dspic33_can_pin(cpu, 65u, &high) && high &&
               (cpu->io.can_rx_error_active & 2u) != 0u,
           "error-passive CAN receiver flag remains recessive");
}

