tylertms/dspic33e-sim/tests/device/can_test.c
static bool drive_can_recessive_bits(Dspic33* cpu, uint8_t pin, uint16_t count) {
    for (uint16_t bit = 0u; bit < count; bit++) {
        if (!dspic33_can_input_pin(cpu, pin, true, 0u) ||
            !dspic33_device_advance(cpu, 4u)) {
            return false;
        }
    }
    return true;
}

static void bus_off_recovery_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xde00u + channel * 0x100u);
        uint8_t function = (uint8_t)(14u + channel);
        bool high;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, function);
        dspic33_write_word(cpu, 0x06d4u, channel == 0u ? 65u : (uint16_t)(65u << 8u));
        configure_transmit(cpu, channel, memory);
        Dspic33CanFrame input =
            frame((uint32_t)(0x300u + channel), false, false, 0u, 0u);
        write_transmit_frame(cpu, memory, &input);
        select_window(cpu, channel, false);
        dspic33_write_word(cpu, (uint16_t)(base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(base + 0x12u), 0u);
        set_mode(cpu, channel, 0u);
        expect(state,
               dspic33_can_error(cpu, channel, true, 248u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) >> 8u) == 248u,
               "CAN transmitter reaches the bus-off boundary precursor");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   drive_unacknowledged_can_frame(cpu, channel, 64u, 65u, 4u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x2000u) != 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x30u)) & 0x0018u) ==
                       0x0018u,
               "missing ACK at TEC 248 enters CAN bus-off");
        expect(state,
               dspic33_can_pin(cpu, 64u, &high) && high &&
                   cpu->io.can_tx_error_active == 0u && cpu->io.can_tx_retry_wait == 0u,
               "bus-off CAN controller releases the bus and suppresses retry");
        expect(state,
               drive_can_recessive_bits(cpu, 65u, 10u) &&
                   dspic33_can_input_pin(cpu, 65u, false, 0u) &&
                   dspic33_device_advance(cpu, 4u) &&
                   drive_can_recessive_bits(cpu, 65u, 1407u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x2000u) != 0u &&
                   cpu->io.can_bus_off_recessive_bits[channel] == 1407u,
               "dominant CAN bit resets the bus-off recovery sequence");
        expect(state,
               drive_can_recessive_bits(cpu, 65u, 1u) &&
                   dspic33_device_advance(cpu, 4u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x3f00u) == 0u &&
                   dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) == 0u &&
                   (cpu->io.can_tx_on_bus & (uint8_t)(1u << channel)) != 0u,
               "CAN recovers after 128 occurrences of 11 recessive bits");
        dspic33_write_word(cpu, (uint16_t)(base + 0x30u), 0x0093u);
    }
}

static void error_counter_recovery_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint32_t memory = (uint32_t)(0xe000u + channel * 0x100u);
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0x5au);
        dspic33_reset(cpu, 0u);
        configure_receive(cpu, channel, memory, 4u, 0u);
        configure_filter(cpu, channel, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, channel, 1u);
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        expect(state,
               dspic33_can_error(cpu, channel, false, 1u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) & 0x00ffu) == 0u,
               "successful CAN reception decrements REC below error-passive");

        dspic33_reset(cpu, 0u);
        configure_receive(cpu, channel, memory, 4u, 0u);
        configure_filter(cpu, channel, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, channel, 1u);
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        expect(state,
               dspic33_can_error(cpu, channel, false, 128u, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) & 0x00ffu) ==
                       127u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 0x0800u) == 0u,
               "successful CAN reception leaves error-passive in the documented range");

        dspic33_reset(cpu, 0u);
        configure_receive(cpu, channel, memory, 4u, 0u);
        configure_filter(cpu, channel, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, channel, 1u);
        select_window(cpu, channel, false);
        set_mode(cpu, channel, 0u);
        bool prepared = dspic33_can_error(cpu, channel, false, 5u, 0u) &&
                        dspic33_device_advance(cpu, 0u);
        set_mode(cpu, channel, 3u);
        expect(state,
               prepared && dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u) &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) & 0x00ffu) == 5u,
               "listen-only CAN reception freezes REC");
    }
}

static void receive_pps_cases(TestState* state, Dspic33* cpu) {
    expect(state, !dspic33_can_input_pin(cpu, 63u, true, 0u),
           "CAN input rejects non-remappable pin");
    for (uint8_t transmit_channel = 0u; transmit_channel < DSPIC33_CAN_COUNT;
         transmit_channel++) {
        uint8_t receive_channel = (uint8_t)(transmit_channel ^ 1u);
        uint8_t pin = (uint8_t)(64u + transmit_channel);
        uint16_t transmit_base = bases[transmit_channel];
        uint16_t receive_base = bases[receive_channel];
        uint32_t transmit_memory = (uint32_t)(0xd800u + transmit_channel * 0x100u);
        uint32_t receive_memory = (uint32_t)(0xda00u + transmit_channel * 0x100u);
        Dspic33CanFrame input =
            frame(transmit_channel == 0u ? 0x345u : 0x1234567u, transmit_channel != 0u,
                  false, 3u, (uint8_t)(0x60u + transmit_channel * 0x10u));
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
        dspic33_write_word(cpu, 0x06d4u, (uint16_t)(pin | ((uint16_t)pin << 8u)));
        configure_receive(cpu, receive_channel, receive_memory, 4u, 0u);
        configure_filter(cpu, receive_channel, 0u, input.identifier, input.extended,
                         input.extended ? 0x1fffffffu : 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, receive_channel, 1u);
        configure_transmit(cpu, transmit_channel, transmit_memory);
        write_transmit_frame(cpu, transmit_memory, &input);
        select_window(cpu, transmit_channel, false);
        select_window(cpu, receive_channel, false);
        dspic33_write_word(cpu, (uint16_t)(transmit_base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(transmit_base + 0x12u),
                           transmit_channel == 0u ? 0u : 0x0311u);
        dspic33_write_word(cpu, (uint16_t)(receive_base + 0x10u), 0u);
        dspic33_write_word(cpu, (uint16_t)(receive_base + 0x12u),
                           transmit_channel == 0u ? 0u : 0x0311u);
        set_mode(cpu, transmit_channel, 0u);
        set_mode(cpu, receive_channel, 0u);
        dspic33_write_word(cpu, (uint16_t)(transmit_base + 0x30u), 0x008bu);
        bool acknowledge_observed = false;
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   bridge_can_pins(
                       cpu, transmit_channel, pin, (uint8_t)(65u - transmit_channel),
                       transmit_channel == 0u ? 4u : 10u, -1, &acknowledge_observed),
               "CAN PPS serial frame bridge advances");
        expect(state,
               receive_full(cpu, receive_channel, 0u) &&
                   cpu->io.can_rx_serial_count[receive_channel] != 0u &&
                   (cpu->io.can_rx_serial_active & (uint8_t)(1u << receive_channel)) ==
                       0u,
               "CAN PPS receiver accepts a complete stuffed frame");
        expect(state,
               memory_word(cpu, receive_memory) ==
                       (uint16_t)(((input.extended ? (input.identifier >> 18u) & 0x7ffu
                                                   : input.identifier)
                                   << 2u) |
                                  (input.extended ? 3u : 0u)) &&
                   (uint8_t)memory_word(cpu, receive_memory + 6u) == input.data[0] &&
                   (uint8_t)(memory_word(cpu, receive_memory + 6u) >> 8u) ==
                       input.data[1],
               "CAN PPS receiver preserves header and payload bits");
        expect(
            state,
            acknowledge_observed &&
                (dspic33_read_word(cpu, (uint16_t)(transmit_base + 0x30u)) & 0x0010u) ==
                    0u &&
                (dspic33_read_word(cpu, (uint16_t)(transmit_base + 0x0eu)) >> 8u) == 0u,
            "CAN PPS receiver drives the acknowledge slot dominant");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
    dspic33_write_word(cpu, 0x06d4u, 0x4000u);
    configure_receive(cpu, 1u, 0xdc00u, 4u, 0u);
    configure_filter(cpu, 1u, 0u, 0u, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 1u, 1u);
    configure_transmit(cpu, 0u, 0xde00u);
    Dspic33CanFrame invalid = frame(0u, false, false, 0u, 0u);
    write_transmit_frame(cpu, 0xde00u, &invalid);
    select_window(cpu, 0u, false);
    select_window(cpu, 1u, false);
    dspic33_write_word(cpu, 0x050cu, 0x0080u);
    set_mode(cpu, 0u, 0u);
    set_mode(cpu, 1u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    bool acknowledge_observed = false;
    expect(state,
           dspic33_device_advance(cpu, 8u) &&
               bridge_can_pins(cpu, 0u, 64u, 65u, 4u, 42, &acknowledge_observed),
           "corrupted CAN PPS frame advances");
    expect(state,
           (dspic33_read_word(cpu, 0x050au) & 0x0080u) != 0u &&
               !receive_full(cpu, 1u, 0u),
           "corrupted CAN PPS frame raises IVRIF without receive data");
}

