tylertms/dspic33e-sim/tests/device/can_test.c
static void receive_pps_qualification_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t modes[] = {0u, 3u, 7u, 2u, 4u, 1u};
    for (uint8_t index = 0u; index < sizeof(modes); index++) {
        uint8_t mode = modes[index];
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x06d4u, 64u);
        set_mode(cpu, 0u, mode);
        expect(state,
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
                   dspic33_device_advance(cpu, 0u) &&
                   (((cpu->io.can_rx_serial_active & 1u) != 0u) ==
                    (mode == 0u || mode == 3u || mode == 7u)),
               "CAN receive mode qualifies physical start of frame");
    }

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xfffeu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "CAN PPS receiver rejects an output pin");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0x0040u);
    dspic33_write_word(cpu, 0x06d4u, 70u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_input_pin(cpu, 70u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "CAN PPS receiver rejects an analog pin");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 65u);
    set_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "CAN PPS receiver rejects an unmapped pin");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0760u, (uint16_t)(dspic33_read_word(cpu, 0x0760u) | 2u));
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (cpu->io.can_rx_serial_active & 1u) == 0u,
           "PMD suppresses the CAN PPS receiver");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    set_mode(cpu, 0u, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x040au) & 0x0040u) == 0u,
           "disabled CAN wake filter rejects physical bus activity");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    dspic33_write_word(cpu, 0x0412u, 0x4000u);
    set_mode(cpu, 0u, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x040au) & 0x0040u) != 0u,
           "enabled CAN wake filter accepts physical bus activity");
}

static void priority_and_abort_cases(TestState* state, Dspic33* cpu) {
    Dspic33CanFrame output;
    uint8_t buffer;
    dspic33_reset(cpu, 0u);
    configure_transmit(cpu, 0u, 0xb000u);
    for (buffer = 0u; buffer < 8u; buffer++) {
        write_memory_word(cpu, (uint32_t)(0xb000u + buffer * 16u),
                          (uint16_t)((0x100u + buffer) << 2u));
        write_memory_word(cpu, (uint32_t)(0xb004u + buffer * 16u), 0u);
    }
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x8988u);
    dspic33_write_word(cpu, 0x0432u, 0x8a8bu);
    dspic33_write_word(cpu, 0x0434u, 0x8a89u);
    dspic33_write_word(cpu, 0x0436u, 0x8b8bu);
    expect(state, dspic33_device_advance(cpu, 32768u), "priority transmissions");
    expect(state, dspic33_can_transmit(cpu, 0u, &output) && output.identifier == 0x107u,
           "highest priority natural order");
    expect(state, dspic33_can_transmit(cpu, 0u, &output) && output.identifier == 0x106u,
           "second highest natural order");
    dspic33_reset(cpu, 0u);
    select_window(cpu, 0u, false);
    dspic33_write_word(cpu, 0x0430u, 0x8989u);
    dspic33_write_word(cpu, 0x0400u,
                       (uint16_t)(dspic33_read_word(cpu, 0x0400u) | 0x1000u));
    expect(state, (dspic33_read_word(cpu, 0x0430u) & 0x4848u) == 0x4040u,
           "abort flags and request clear");
    expect(state, (dspic33_read_word(cpu, 0x0400u) & 0x1000u) == 0u,
           "abort all self clear");
}

static void mode_and_power_cases(TestState* state, Dspic33* cpu) {
    static const uint8_t modes[] = {0u, 1u, 2u, 3u, 4u, 7u};
    uint8_t index;
    for (index = 0u; index < sizeof(modes); index++) {
        uint8_t mode = modes[index];
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, mode);
        dspic33_reset(cpu, 0u);
        configure_receive(cpu, 0u, 0xc000u, 4u, 0u);
        configure_filter(cpu, 0u, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, 0u, mode == 7u ? 0u : 1u);
        select_window(cpu, 0u, false);
        set_mode(cpu, 0u, mode);
        expect(state, ((dspic33_read_word(cpu, 0x0400u) >> 5u) & 7u) == mode,
               "mode acknowledgement matrix");
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "mode receive schedule");
        expect(state,
               receive_full(cpu, 0u, 0u) ==
                   (mode == 0u || mode == 2u || mode == 3u || mode == 7u),
               "mode receive behavior");
    }
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, 0u, 0xc000u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
    enable_filter(cpu, 0u, 1u);
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0760u, (uint16_t)(dspic33_read_word(cpu, 0x0760u) | 2u));
    {
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0u);
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "PMD receive schedule");
        expect(state, !receive_full(cpu, 0u, 0u), "PMD blocks receive");
    }
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x040cu, 0x0040u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    {
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0u);
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 1u),
               "unfiltered sleep activity schedule");
        expect(state, (dspic33_read_word(cpu, 0x040au) & 0x0040u) == 0u,
               "disabled CAN wake filter rejects sleep activity");
    }
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0412u, 0x4000u);
    dspic33_write_word(cpu, 0x040cu, 0x0040u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    {
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0u);
        expect(state,
               dspic33_can_receive(cpu, 0u, &input, 0u) &&
                   dspic33_device_advance(cpu, 1u),
               "filtered sleep wake schedule");
        expect(state, (dspic33_read_word(cpu, 0x040au) & 0x0040u) != 0u,
               "enabled CAN wake filter raises wake flag");
    }
}

static void mode_transition_cases(TestState* state, Dspic33* cpu) {
    uint64_t cycles;
    dspic33_reset(cpu, 0u);
    cycles = mode_transition_cycles(cpu, 0u);
    request_mode(cpu, 0u, 0u);
    expect(state, (dspic33_read_word(cpu, 0x0400u) & 0x07e0u) == 0x0080u,
           "CAN mode request preserves the active mode before bus idle");
    expect(state,
           dspic33_device_advance(cpu, cycles - 1u) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x00e0u) == 0x0080u,
           "CAN mode request remains pending before 11 recessive bits");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x00e0u) == 0u,
           "CAN mode request completes after 11 recessive bits");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x0e30u, 0xffffu);
    dspic33_write_word(cpu, 0x0e3eu, 0u);
    dspic33_write_word(cpu, 0x06d4u, 64u);
    request_mode(cpu, 0u, 0u);
    expect(state,
           dspic33_device_advance(cpu, cycles - 1u) &&
               dspic33_can_input_pin(cpu, 64u, false, 0u) &&
               dspic33_device_advance(cpu, 0u) &&
               dspic33_can_input_pin(cpu, 64u, true, 0u) &&
               dspic33_device_advance(cpu, 0u) && dspic33_device_advance(cpu, 1u) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x00e0u) == 0x0080u,
           "dominant CAN input restarts the mode idle boundary");
    expect(state,
           dspic33_device_advance(cpu, cycles - 1u) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x00e0u) == 0u,
           "CAN mode transition completes after the restarted idle boundary");

    request_mode(cpu, 0u, 3u);
    request_mode(cpu, 0u, 2u);
    expect(state,
           dspic33_device_advance(cpu, cycles) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x07e0u) == 0x0240u,
           "new CAN mode request supersedes a pending transition");

    Dspic33 copy;
    expect(state, dspic33_initialize(&copy), "initialize pending CAN mode copy");
    request_mode(cpu, 0u, 3u);
    expect(state, dspic33_copy(&copy, cpu), "copy pending CAN mode transition");
    expect(state,
           dspic33_device_advance(cpu, cycles) &&
               dspic33_device_advance(&copy, cycles) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x00e0u) == 0x0060u &&
               (dspic33_read_word(&copy, 0x0400u) & 0x00e0u) == 0x0060u,
           "copy preserves pending CAN mode transition phase");
    dspic33_destroy(&copy);

    dspic33_reset(cpu, 0u);
    request_mode(cpu, 0u, 0u);
    dspic33_reset(cpu, 0u);
    expect(state,
           dspic33_device_advance(cpu, cycles) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x07e0u) == 0x0480u &&
               cpu->events.count == 0u,
           "reset cancels a pending CAN mode transition");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX;
    request_mode(cpu, 0u, 0u);
    expect(state,
           cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR && cpu->events.count == 0u &&
               (dspic33_read_word(cpu, 0x0400u) & 0x07e0u) == 0x0080u,
           "CAN mode schedule overflow leaves the request pending");

    dspic33_reset(cpu, 0u);
    configure_transmit(cpu, 0u, 0xde00u);
    Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0x5au);
    write_transmit_frame(cpu, 0xde00u, &input);
    select_window(cpu, 0u, false);
    dspic33_write_word(cpu, 0x0410u, 0u);
    dspic33_write_word(cpu, 0x0412u, 0u);
    set_mode(cpu, 0u, 0u);
    dspic33_write_word(cpu, 0x0430u, 0x008bu);
    expect(state, dspic33_device_advance(cpu, 8u) && (cpu->io.can_tx_on_bus & 1u) != 0u,
           "CAN mode transition test reaches an active frame");
    request_mode(cpu, 0u, 4u);
    expect(state,
           dspic33_device_advance(cpu, cycles) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x00e0u) == 0u &&
               (cpu->io.can_tx_on_bus & 1u) != 0u,
           "CAN mode transition waits for the active frame");
    expect(state,
           dspic33_device_advance(cpu, 256u) &&
               (dspic33_read_word(cpu, 0x0400u) & 0x00e0u) == 0x0080u,
           "CAN mode transition completes after the active frame and idle boundary");
}

static void physical_debug_mode_cases(TestState* state, Dspic33* cpu) {
    for (uint8_t mode = 3u; mode <= 7u; mode += 4u) {
        Dspic33CanFrame input = frame(0x234u, false, false, 1u, 0x5au);
        bool acknowledge_observed = false;
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, 0x0e30u, 0xffffu);
        dspic33_write_word(cpu, 0x0e3eu, 0u);
        dspic33_write_word(cpu, 0x0680u, 0x0f0eu);
        dspic33_write_word(cpu, 0x06d4u, 0x4000u);
        configure_transmit(cpu, 0u, 0xde00u);
        configure_receive(cpu, 1u, 0xdc00u, 4u, 0u);
        configure_filter(cpu, 1u, 0u, 0x234u, false, 0x7ffu, true, 0u, 0u);
        enable_filter(cpu, 1u, 1u);
        write_transmit_frame(cpu, 0xde00u, &input);
        select_window(cpu, 0u, false);
        select_window(cpu, 1u, false);
        dspic33_write_word(cpu, 0x0410u, 0u);
        dspic33_write_word(cpu, 0x0412u, 0u);
        dspic33_write_word(cpu, 0x0510u, 0u);
        dspic33_write_word(cpu, 0x0512u, 0u);
        set_mode(cpu, 0u, 0u);
        set_mode(cpu, 1u, mode);
        dspic33_write_word(cpu, 0x0430u, 0x008bu);
        expect(state,
               dspic33_device_advance(cpu, 8u) &&
                   bridge_can_pins(cpu, 0u, 64u, 65u, 4u, -1, &acknowledge_observed),
               "CAN debug receive mode advances a valid physical frame");
        expect(state,
               receive_full(cpu, 1u, 0u) &&
                   (dspic33_read_word(cpu, 0x050eu) & 0x00ffu) == 0u &&
                   (cpu->io.can_rx_error_active & 2u) == 0u,
               "CAN debug receive mode accepts a valid physical frame");
        expect(state, acknowledge_observed == (mode == 7u),
               "CAN listen-only mode suppresses physical acknowledgement");

